
-- TODO: INSERT ข้อมูลตัวอย่างทุกตาราง

INSERT INTO customer (name, email, gender, birthdate, tier)
VALUES
('พีรพัฒน์ ดาตู', 'sriithnaewthysumachyaa@outlook.com', 'ชาย', '1959-12-18', 'vip'),
('พิมพ์พิชญา ไทนิยม', 'ophaasbuybamrung@yahoo.com', 'หญิง', '1946-07-07', 'gold'),
('ภูวัน บุณยะภาชน์', 'thiphrdaaephiiyyaa@ymail.com', 'ชาย', '1928-10-07', 'vip'),
('สุรธัช ทองปากน้ำ', 'shasmniidamrihchb@gmail.com', 'ชาย', '2025-01-25', 'normal'),
('จิรวิทย์ ถนัดอักษร', 'saaraphanthenchaa@outlook.com', 'ชาย', '1957-10-12', 'silver'),
('สุชิน ถนอมพลกรัง', 'rphin71@icloud.com', null, '1925-04-17', 'normal'),
('ผดุงพล วาทา', 'tthnmphlkrang@kon.in.th', null, '2022-03-08', 'gold'),
('ธีรลักษณ์ นักรบ', 'suphaaphr92@gmail.com', 'ชาย', '1917-03-21', 'silver'),
('เทพนารี ทีฆะ', 'mnilsuwrrn@ymail.com', null, '2009-10-30', 'gold'),
('วรดาพร ดวงทับทิม', 'oythikaar46@ymail.com', null, '1942-05-14', 'silver'),
('ศิรณัฐ จันอ้น', 'nathphlnamthiphy@outlook.com', 'ชาย', '2020-09-27', 'normal'),
('เอกชัย นิยมธรรม', 'nphthnadedinkhaaw@protonmail.com', null, '2019-03-04', 'normal'),
('ณัฐญาดา ดาวอร่าม', 'itansthity@gmail.com', null, '1990-08-02', 'vip'),
('ศศินา ร่มธิติรัตน์', 'echlimrath30@yahoo.com', null, '1985-04-02', 'gold'),
('ธีรวุฒิ ดิสกะประกาย', 'phchrphrn41@outlook.com', null, '1930-04-18', 'vip'),
('ดิลก ถนัดอาวุธ', 'tangephaasmhmaay@outlook.com', 'ชาย', '1928-11-08', 'gold'),
('เฉลิมรัตน์ ดำริห์ชอบ', 'phuuwan65@outlook.com', null, '1968-02-03', 'silver'),
('สุทธิพจน์ พีระเพ็ญกุล', 'raanii35@icloud.com', null, '2007-06-29', 'silver'),
('สินสมุทร ตั้งเผ่า', 'phrebyyaa64@yahoo.com', 'ชาย', '1922-07-04', 'gold'),
('วิพุธ ดาตู', 'wbuysl@hotmail.com', null, '1944-01-23', 'silver'),
('สราญจิตต์ ทวนทอง', 'odaawraam@icloud.com', null, '1954-09-22', 'silver'),
('พรพิไล พงศ์ฉบับนภา', 'cchakrchay11@icloud.com', 'หญิง', '2006-04-12', 'vip'),
('ประไพพักตร์ ยาปะโลหิต', 'pphaawrinthr40@kon.in.th', 'หญิง', '1926-03-30', 'normal'),
('วรนาฎ ศรทอง', 'eksraahmphikul@outlook.com', 'หญิง', '1921-01-22', 'vip'),
('นิวิลดาน นิละทัต', 'wrnaad70@icloud.com', null, '2016-01-25', 'silver'),
('รอกีเย๊าะ ขอหมั่นกลาง', 'thrrmthinnaaphimphsutaa@icloud.com', 'หญิง', '1912-11-24', 'normal'),
('พรชนก ถนัดหัตถกรรม', 'nathyaadaanabenuuengn@outlook.com', 'หญิง', '1937-03-31', 'normal'),
('นิติยา ตวันเยี่ยม', 'ulayphraetkul@gmail.com', null, '1948-04-19', 'normal'),
('โสภา ธรรมเมธา', 'praphathrsrnphuuphakdii@gmail.com', null, '2005-09-07', 'gold'),
('ปิยบุตร ธรรมนิยม', 'ophiiraephykul@yahoo.com', 'ชาย', '1962-08-18', 'vip'),
('นิรุตต์ เลิศกิ่ง', 'nirahaaniiphiiraphngsphanth@outlook.com', 'ชาย', '1918-07-21', 'silver'),
('ปัตถพงษ์ ชำนาญวาด', 'sirithnadphimphkaar@hotmail.com', null, '1941-06-17', 'vip'),
('ชัฎชา ฉัตรอภิเที่ยงค่ำ', 'suthaawii48@kon.in.th', 'หญิง', '1988-07-09', 'vip'),
('มาซีเตาะ พงศ์ฉบับนภา', 'chidchnk57@hotmail.com', null, '2004-06-19', 'gold'),
('ทรรศนชัย ธรรมนิยม', 'nilsuwrrnsmhmaay@protonmail.com', null, '1990-06-11', 'normal'),
('วรรณรัตน์ นาคะนคร', 'siwawrewthsuphnunaay@outlook.com', 'หญิง', '1994-06-30', 'gold'),
('นิชนันท์ ถนัดรักษา', 'chrinthrthiphyaethnthng@protonmail.com', 'ชาย', '1948-05-15', 'gold'),
('นิรุตต์ ดำริห์ชอบ', 'emsaa99@icloud.com', null, '1945-05-04', 'vip'),
('วรรณชนะชัย ดำริห์ชอบ', 'thiirisraaaethmthn@kon.in.th', 'ชาย', '1951-02-28', 'gold'),
('อัญพัชร์ เช้าวันดี', 'thmpadaaphasraa@hotmail.com', 'หญิง', '2017-05-08', 'silver');

INSERT INTO address (address_type, cust_id, line_1, province, postal_code)
VALUES
('shipping', 1, '84 ถ.บุญศล ตำบลเขาขาว อำเภอปลาปาก', 'พัทลุง', '80720'),
('shipping', 2, '06 หมู่ 3 ซอยจ้อยนุแสง วัดบางแค นาแก', 'กรุงเทพฯ', '32790'),
('shipping', 3, '90 หมู่ 83 ถนนทองแท้ สามโคก', 'นครพนม', '15960'),
('shipping', 4, '99 หมู่ 01 ถ.ศรีเผด็จ อ.บ่อไร่', 'มุกดาหาร', '82060'),
('shipping', 5, '49/52 ถ.แนวพนิช เนินขาม', 'นนทบุรี', '85360'),
('shipping', 6, '3 ถนนหิรัญสาลี ต.วัดหนองอิเฒ่า อ.บำเหน็จณรงค์', 'สระบุรี', '14660'),
('shipping', 7, '808/1 ถนนหอมพิกุล ต.โคกกรวด อ.บางสะพานน้อย', 'นครสวรรค์', '83130'),
('shipping', 8, '381/4 ถนนเพียยา ตำบลโนนศิลาเหนือ อำเภอปากคาด', 'ลำปาง', '32810'),
('shipping', 9, '857/10 ถนนคณานุรักษ์ ต.ปากคมเหนือ', 'ตราด', '79150'),
('shipping', 10, '878 ถ.นักสำหรวจ ต.ท่าเรือ อ.หนองบัวระเหว', 'สุรินทร์', '34400'),
('shipping', 11, '20 ถนนนานายน บ้านแท่น', 'ชลบุรี', '20880'),
('shipping', 12, '701/2 ถนนผลบุญ ต.บึงคลองเขื่อน อ.สะพานสูง', 'สิงห์บุรี', '54770'),
('shipping', 13, '913 ถนนนกทอง ตำบลดอนสมบูรณ์ อำเภอภูเขียว', 'กระบี่', '15420'),
('shipping', 14, '50 หมู่ 4 ถ.ธนประทีป อ.เวียงแก่น', 'แม่ฮ่องสอน', '69840'),
('shipping', 15, '76 หมู่ 3 ถนนไทยสุชาต หนองปลาหมอ ศรีวิไล', 'กาฬสินธุ์', '97520'),
('shipping', 16, '46 หมู่ 79 ถ.ดาวกระจาย ป้อมปราบศัตรูพ่าย', 'ตราด', '44720'),
('shipping', 17, '73/06 ถนนดัตพันธุ์ อำเภอแม่ลาว', 'นครราชสีมา', '44830'),
('shipping', 18, '50/6 ถ.ศรีวงค์ อ.เวียงแก่น', 'ภูเก็ต', '49260'),
('shipping', 19, '725 ต.เปือยใหญ่เหนือ อ.เทิง', 'อุทัยธานี', '21800'),
('shipping', 20, '850/3 ถนนหอมพิกุล ตำบลหนองตอกแป้น อำเภอสามโคก', 'สมุทรสาคร', '37830'),
('shipping', 21, '85 หมู่ 28 ถนนบุนยาภิสนท์ อ.เรณูนคร', 'ระนอง', '65430'),
('shipping', 22, '936/93 ถนนเยาวธนโชค อำเภอบ้านแท่น', 'ชัยภูมิ', '23210'),
('shipping', 23, '635/1 ซอยนิลเสนา เขาขาว', 'นครศรีธรรมราช', '85740'),
('shipping', 24, '044 ถ.ชุมวระ บางกุ้ง', 'อุดรธานี', '50340'),
('shipping', 25, '886/3 ถนนตันตราจิณ ต.ในเตาใต้', 'อุบลราชธานี', '95100'),
('shipping', 26, '024 ถ.ธูปะวิโรจน์ ต.หัวนาคำ อ.โพนสวรรค์', 'ฉะเชิงเทรา', '98840'),
('shipping', 27, '46/8 ถ.นุชแนวนุ่ม ตำบลบ้านบางกุ้งกลาง อำเภอสามโคก', 'น่าน', '68070'),
('shipping', 28, '47 ถนนดิสกะประกาย ตำบลท่างิ้ว', 'นนทบุรี', '16860'),
('shipping', 29, '54 หมู่ 1 ถ.บุนยะตีรณะ เปือยใหญ่กลาง', 'ระยอง', '27400'),
('shipping', 30, '78/3 ถนนด้วงโสน ตำบลบ่อในเตา อำเภอบึงกุ่ม', 'กำแพงเพชร', '76100'),
('shipping', 31, '49 ซอยขุนดำ', 'พิจิตร', '71140'),
('shipping', 32, '71 หมู่ 92 ถ.นพคเชนทร์ บางไผ่ใหม่', 'บุรีรัมย์', '83350'),
('shipping', 33, '526 ถ.บินดี บึงลำภูรา สะพานสูง', 'สุราษฎร์ธานี', '47700'),
('shipping', 34, '546/80 ถ.ตระกูลไม้เรียง อ.บ่อไร่', 'ภูเก็ต', '52430'),
('shipping', 35, '116/6 ถนนนวลเพ็ง อำเภอคอนสวรรค์', 'ลำพูน', '85600'),
('shipping', 36, '44/3 ถนนศรีวงค์ ต.บ่อยางตลาด อ.หนองบัวโคก', 'เลย', '67850'),
('shipping', 37, '84 หมู่ 3 ถ.ซูสารอ ตำบลบางกุ้ง', 'ศรีสะเกษ', '89960'),
('shipping', 38, '7 ถนนเนื่องนนท์ อำเภอโพนสวรรค์', 'อำนาจเจริญ', '31500'),
('shipping', 39, '32 หมู่ 51 ถ.วุฑฒยากร ต.นาดี อ.นาแก', 'แม่ฮ่องสอน', '11700'),
('shipping', 40, '48 หมู่ 7 ถนนโพธิสัตย์ ต.นาดี อ.เมือง', 'ชัยภูมิ', '52680');

INSERT INTO primary_category (name)
VALUES 
('Books'),
('Movies'),	('Music'),	('Games'),
('Electronics'),	('Computers'),	('Home'),
('Garden'),	('Tools'),	('Grocery'),
('Health'),	('Beauty'),	('Toys'),
('Kids'),	('Baby'),	('Clothing'),
('Shoes'),	('Jewelery'),	('Sports'),
('Outdoors'),	('Automotive'),	('Industrial');

INSERT INTO category (name)
VALUES 
('Steel'),
('Wooden'),	('Concrete'),	('Plastic'),
('Cotton'),	('Granite'),	('Rubber'),
('Metal'),	('Soft'),	('Fresh'),
('Frozen'),	('Small'),	('Ergonomic'),
('Rustic'),	('Intelligent'),	('Gorgeous'),
('Incredible'),	('Fantastic'),	('Practical'),
('Sleek'),	('Awesome'),	('Generic'),
('Handcrafted'),	('Handmade'),	('Licensed'),
('Refined'),	('Unbranded'),	('Tasty'),
('New'),	('Gently Used'),	('Used'),
('For repair');

INSERT INTO product(name, category, price, stock)
VALUES
('Rustic Fresh Fish', 5, 485.12, 38),
('Tasty Frozen Soap', 19, 224.66, 98),
('Intelligent Cotton Shoes', 3, 694.76, 170),
('Tuna', 6, 156.84, 162),
('Wooden Chicken', 18, 300.72, 112),
('Small Chicken', 19, 164.34, 36),
('Gorgeous Rubber Computer', 10, 340.55, 157),
('Practical Mouse', 13, 216.16, 107),
('Gorgeous Rubber Bacon', 2, 129.21, 211),
('Rubber Bike', 2, 233.56, 230),
('Fantastic Computer', 14, 81.79, 29),
('Fresh Bacon', 11, 57.94, 146),
('Handcrafted Frozen Gloves', 17, 34.21, 140),
('Steel Chicken', 3, 241.87, 39),
('Practical Cotton Shoes', 17, 53.66, 145),
('Refined Cotton Chicken', 12, 310.08, 231),
('Gently Used Chips', 12, 155.71, 54),
('Wooden Chair', 9, 396.2, 191),
('Gorgeous Keyboard', 20, 20.49, 222),
('Rustic Ball', 12, 74.6, 226),
('Cotton Towels', 21, 227.81, 14),
('Small Metal Salad', 5, 241.75, 186),
('Small Wooden Chicken', 12, 168.43, 207),
('Refined Hat', 8, 87.82, 195),
('Practical Tuna', 8, 98.25, 49),
('Tuna', 20, 166.68, 51),
('Ergonomic Towels', 11, 217.83, 10),
('Chips', 13, 71.96, 60),
('Cotton Tuna', 9, 102.59, 102),
('Granite Chips', 8, 383.32, 128),
('Salad', 21, 847.81, 161),
('Ergonomic Metal Sausages', 19, 243.27, 100),
('Soft Gloves', 20, 51.78, 204),
('Gorgeous Plastic Fish', 3, 926.32, 154),
('Refined Hat', 16, 201.14, 9),
('Plastic Shirt', 14, 539.18, 125),
('Table', 12, 303.52, 250),
('Gently Used Sausages', 18, 508.75, 116),
('Frozen Cheese', 2, 236.57, 27),
('Wooden Cheese', 20, 440.29, 51),
('Pizza', 3, 291.98, 110),
('Table', 19, 414.52, 198),
('Tuna', 20, 905.56, 160),
('Keyboard', 14, 128.36, 93),
('Wooden Sausages', 17, 182.54, 17),
('Fish', 16, 359.07, 97),
('Chicken', 20, 44.65, 124),
('Tasty Bike', 5, 59.18, 220),
('Steel Sausages', 7, 32.59, 121),
('Frozen Bacon', 6, 17.35, 60),
('Licensed Tuna', 5, 185.6, 21),
('For repair Mouse', 19, 252.83, 81),
('Wooden Hat', 9, 162.67, 219),
('Granite Hat', 5, 294.16, 97),
('Computer', 18, 272.65, 119),
('Practical Gloves', 1, 514.43, 106),
('New Chips', 7, 20.88, 157),
('Rubber Sausages', 1, 315.93, 108),
('Tasty Soft Shoes', 14, 85.53, 196),
('For repair Plastic Shirt', 12, 268.16, 146);



INSERT INTO shop_order (cust_id, order_date, status, address, sub_total, discount, total)
VALUES
(3, '2024-05-24', 'pending', 3, 0, 0, 0),
(32, '2024-11-02', 'shipped', 32, 0, 0, 0),	(25, '2022-04-25', 'shipped', 25, 0, 0, 0),	(9, '2023-06-29', 'cancel', 9, 0, 0, 0),
(3, '2022-05-10', 'cancel', 3, 0, 0, 0),	(12, '2020-12-07', 'pending', 12, 0, 0, 0),	(31, '2025-02-03', 'shipped', 31, 0, 0, 0),
(7, '2022-10-15', 'shipped', 7, 0, 0, 0),	(18, '2022-11-18', 'shipped', 18, 0, 0, 0),	(37, '2022-10-05', 'pending', 37, 0, 0, 0),
(31, '2021-11-26', 'shipped', 31, 0, 0, 0),	(13, '2021-03-18', 'shipped', 13, 0, 0, 0),	(30, '2020-04-11', 'pending', 30, 0, 0, 0),
(24, '2022-07-31', 'pending', 24, 0, 0, 0),	(35, '2025-09-03', 'pending', 35, 0, 0, 0),	(16, '2021-12-16', 'shipped', 16, 0, 0, 0),
(16, '2023-12-10', 'shipped', 16, 0, 0, 0),	(9, '2020-12-03', 'shipped', 9, 0, 0, 0),	(5, '2025-09-07', 'shipped', 5, 0, 0, 0),
(34, '2025-04-01', 'shipped', 34, 0, 0, 0),	(21, '2021-12-11', 'cancel', 21, 0, 0, 0),	(11, '2024-07-12', 'cancel', 11, 0, 0, 0),
(15, '2024-02-25', 'cancel', 15, 0, 0, 0),	(21, '2020-12-19', 'shipped', 21, 0, 0, 0),	(28, '2022-02-04', 'shipped', 28, 0, 0, 0),
(35, '2021-02-26', 'cancel', 35, 0, 0, 0),	(37, '2025-05-27', 'cancel', 37, 0, 0, 0),	(5, '2025-09-19', 'cancel', 5, 0, 0, 0),
(26, '2021-12-31', 'cancel', 26, 0, 0, 0),	(12, '2023-01-05', 'cancel', 12, 0, 0, 0),	(14, '2022-01-13', 'pending', 14, 0, 0, 0),
(9, '2021-07-26', 'shipped', 9, 0, 0, 0),	(30, '2023-09-04', 'pending', 30, 0, 0, 0),	(34, '2020-05-18', 'shipped', 34, 0, 0, 0),
(25, '2024-11-29', 'cancel', 25, 0, 0, 0),	(38, '2023-05-30', 'cancel', 38, 0, 0, 0),	(13, '2021-09-05', 'shipped', 13, 0, 0, 0),
(31, '2021-02-21', 'shipped', 31, 0, 0, 0),	(10, '2020-07-29', 'shipped', 10, 0, 0, 0),	(35, '2025-05-14', 'shipped', 35, 0, 0, 0);


INSERT INTO order_line(order_id, product_id, qty, unit_price)
VALUES
(1, 5, 1, 1),
(1, 44, 8, 1),		(1, 22, 9, 1),		(1, 34, 4, 1),		(1, 48, 2, 1),		(1, 53, 6, 1),
(1, 17, 3, 1),		(2, 52, 8, 1),		(2, 15, 6, 1),		(2, 34, 6, 1),		(2, 9, 4, 1),
(2, 22, 9, 1),		(3, 35, 2, 1),		(3, 5, 9, 1),		(3, 37, 8, 1),		(3, 3, 6, 1),
(3, 36, 4, 1),		(3, 18, 6, 1),		(3, 54, 7, 1),		(4, 44, 3, 1),		(4, 21, 1, 1),
(4, 53, 3, 1),		(4, 10, 3, 1),		(4, 22, 7, 1),		(4, 49, 6, 1),		(4, 35, 4, 1),
(4, 28, 5, 1),		(5, 21, 9, 1),		(5, 39, 2, 1),		(5, 41, 6, 1),		(5, 20, 5, 1),
(5, 42, 4, 1),		(5, 31, 5, 1),		(6, 32, 5, 1),		(6, 48, 7, 1),		(6, 13, 6, 1),
(6, 55, 6, 1),		(6, 26, 6, 1),		(6, 22, 3, 1),		(6, 15, 1, 1),		(7, 31, 4, 1),
(7, 7, 1, 1),		(7, 55, 4, 1),		(8, 37, 1, 1),		(8, 14, 6, 1),		(8, 12, 5, 1),
(8, 19, 9, 1),		(8, 45, 6, 1),		(8, 49, 4, 1),		(9, 51, 3, 1),		(9, 43, 5, 1),
(9, 52, 5, 1),		(10, 21, 9, 1),		(10, 7, 4, 1),		(10, 55, 9, 1),		(11, 44, 7, 1),
(11, 23, 6, 1),		(11, 28, 3, 1),		(11, 9, 4, 1),		(11, 13, 4, 1),		(11, 16, 2, 1),
(12, 34, 3, 1),		(12, 21, 8, 1),		(12, 6, 4, 1),		(12, 52, 3, 1),		(13, 8, 7, 1),
(13, 47, 4, 1),		(13, 43, 7, 1),		(13, 49, 1, 1),		(13, 58, 3, 1),		(13, 12, 9, 1),
(13, 20, 4, 1),		(13, 36, 6, 1),		(14, 16, 7, 1),		(14, 50, 2, 1),		(14, 4, 4, 1),
(14, 42, 5, 1),		(15, 1, 2, 1),		(15, 16, 4, 1),		(15, 13, 4, 1),		(15, 49, 9, 1),
(15, 32, 3, 1),		(15, 56, 3, 1),		(15, 25, 3, 1),		(16, 19, 4, 1),		(16, 22, 7, 1),
(16, 25, 3, 1),		(16, 12, 2, 1),		(16, 52, 6, 1),		(16, 33, 2, 1),		(16, 39, 7, 1),
(17, 41, 6, 1),		(17, 48, 4, 1),		(18, 11, 8, 1),		(18, 2, 8, 1),		(19, 56, 7, 1),
(19, 30, 5, 1),		(19, 50, 1, 1),		(19, 42, 6, 1),		(19, 52, 2, 1),		(20, 17, 8, 1),
(20, 32, 7, 1),		(20, 51, 2, 1),		(20, 15, 8, 1),		(20, 7, 8, 1),		(21, 17, 8, 1),
(21, 8, 2, 1),		(22, 48, 8, 1),		(22, 42, 3, 1),		(22, 38, 9, 1),		(22, 29, 7, 1),
(22, 25, 5, 1),		(22, 18, 1, 1),		(22, 16, 3, 1),		(23, 9, 5, 1),		(23, 36, 5, 1),
(23, 25, 3, 1),		(23, 11, 5, 1),		(23, 47, 2, 1),		(23, 17, 4, 1),		(23, 19, 1, 1),
(24, 36, 1, 1),		(24, 46, 8, 1),		(24, 28, 1, 1),		(24, 55, 9, 1),		(24, 40, 3, 1),
(25, 37, 7, 1),		(25, 15, 3, 1),		(26, 11, 4, 1),		(26, 24, 7, 1),		(26, 12, 6, 1),
(26, 18, 1, 1),		(27, 56, 7, 1),		(27, 15, 8, 1),		(27, 57, 5, 1),		(27, 45, 3, 1),
(27, 37, 4, 1),		(28, 17, 6, 1),		(28, 50, 4, 1),		(28, 49, 2, 1),		(28, 24, 6, 1),
(28, 54, 2, 1),		(28, 2, 5, 1),		(28, 57, 9, 1),		(28, 45, 3, 1),		(29, 7, 6, 1),
(29, 45, 4, 1),		(29, 3, 6, 1),		(30, 55, 6, 1),		(30, 49, 3, 1),		(30, 11, 1, 1),
(30, 39, 7, 1),		(30, 21, 9, 1),		(31, 18, 7, 1),		(31, 28, 6, 1),		(31, 9, 3, 1),
(31, 44, 6, 1),		(31, 3, 1, 1),		(31, 59, 9, 1),		(32, 4, 7, 1),		(32, 59, 4, 1),
(33, 8, 5, 1),		(33, 3, 5, 1),		(34, 40, 5, 1),		(34, 19, 2, 1),		(34, 22, 4, 1),
(34, 24, 6, 1),		(34, 35, 8, 1),		(34, 33, 9, 1),		(35, 39, 1, 1),		(35, 12, 6, 1),
(35, 8, 3, 1),		(35, 28, 5, 1),		(35, 57, 1, 1),		(35, 13, 1, 1),		(36, 49, 8, 1),
(36, 45, 6, 1),		(36, 56, 8, 1),		(36, 16, 6, 1),		(36, 29, 9, 1),		(36, 6, 4, 1),
(36, 5, 7, 1),		(36, 44, 1, 1),		(36, 21, 7, 1),		(37, 23, 4, 1),		(37, 34, 3, 1),
(37, 42, 5, 1),		(38, 21, 9, 1),		(38, 40, 1, 1),		(38, 53, 8, 1),		(39, 51, 8, 1),
(39, 7, 4, 1),		(39, 42, 3, 1),		(39, 30, 4, 1),		(39, 9, 6, 1),		(39, 23, 6, 1),
(39, 25, 4, 1),		(39, 45, 8, 1);

-- Update order_line unit_price

UPDATE  order_line
JOIN    product p ON p.product_id = order_line.product_id
SET     unit_price = p.price;

UPDATE  shop_order s
JOIN    order_line o ON o.order_id = s.order_id
SET     s.sub_total = s.sub_total + o.qty * o.unit_price;

UPDATE  shop_order s
JOIN    customer c ON c.cust_id = s.cust_id
SET     s.discount = s.sub_total * ( 
                    CASE    WHEN c.tier = 'normal' AND s.sub_total >= 1000 THEN 0.05
                            WHEN c.tier = 'silver' AND s.sub_total >= 1000 THEN 0.10
                            WHEN c.tier = 'gold'   AND s.sub_total >= 500  THEN 0.10
                            WHEN c.tier = 'vip'                            THEN 0.15
                    ELSE 0 END
                    );

UPDATE  shop_order s
SET     s.total = s.sub_total - s.discount;


select * from shop_order;