
-- ## CUSTOMER ##
INSERT INTO customer (name, email, gender, birthdate, point, join_date) VALUES
('ภัทราวุธ ศรีอุ่น', 'fnaathaphinthu@example.org', 'M', '2007-1-28', 0, '2025-8-8'),
('อำพร ศรีอุ่น', 'phimphsudaathayaaophchn@example.com', 'M', '2011-12-13', 1000, '2025-5-12'),
('ลักษมี นกทอง', 'phchrphrn21@example.com', 'F', '2005-3-19', 0, '2025-3-26'),
('ฌาฆีภัตฐ์ นุ่มกัน', 'numkanphrchiiwin@example.net', 'F', '2002-3-6', 5000, '2025-6-13'),
('พัชรพร ดาตู', 'niwildaan98@example.org', 'M', '2002-2-24', 1000, '2026-5-3'),
('ปิยวัจน์ วิลาสินี', 'thrrsnchay32@example.org', 'F', '2003-12-16', 0, '2025-8-7'),
('เลิศเดช ตันตราจิณ', 'nilathatethphnaarii@example.net', 'M', '2004-11-22', 500, '2026-4-20'),
('สุไฮลัน ทวีเดช', 'cchittaananth82@example.net', 'F', '2013-12-6', 0, '2026-3-24'),
('ทิมาภรณ์ ธูปหอม', 'hwilaasinii@example.org', 'F', '2002-9-14', 0, '2025-3-14'),
('ฐิติกุล นาฏคายี', 'sechaawandii@example.net', 'M', '2003-6-17', 0, '2026-9-10'),
('สิริ เขียวขุ้ย', 'muuhamhmadimrndamrihchb@example.net', 'M', '2013-11-12', 0, '2026-4-4'),
('จิณภัทตา ถนัดภาษา', 'laksmiidwngthabthim@example.com', 'F', '2012-1-3', 500, '2025-1-1'),
('ผดุงพล แถมธน', 'thayykayyaaewiiyngcchanthuek@example.net', 'M', '2010-3-4', 0, '2025-12-16'),
('ศจีกาญจน์ นานายน', 'qsantawngs@example.net', 'F', '2000-9-13', 0, '2026-2-19'),
('นิมุ ศรีสัตย์', 'sraaycchittnaameswtr@example.net', 'F', '2001-9-4', 0, '2026-8-24'),
('ศุภาศิล โพธิสัตย์', 'wthrrmthinnaa@example.org', 'M', '2007-10-10', 0, '2025-12-27'),
('ฐิติยาพร สันตะวงศ์', 'usniiypaansuwrrn@example.org', 'M', '2003-10-21', 500, '2026-9-9'),
('นัฐพล ศาสตร์ศิลป์', 'pracchin35@example.org', 'M', '2005-7-28', 0, '2025-3-6'),
('ปิยวดี ถนอมพลกรัง', 'cchakrphanth23@example.com', 'M', '2003-8-26', 0, '2025-7-27'),
('มารีนี ปรีชากุลเศรษฐ์', 'echlimrathdaatuu@example.com', 'F', '2013-2-26', 0, '2025-3-26'),
('พิชญ์สินี บัวเผื่อน', 'chimphaaliientrrdii@example.com', 'F', '2003-12-10', 0, '2026-12-7'),
('สุทธิณัฐ ดวงทับทิม', 'buyekhmsin@example.com', 'F', '2010-11-21', 500, '2026-1-23'),
('ศศินา ถาวรายุศม์', 'jthiikha@example.net', 'F', '2009-1-23', 0, '2025-11-26'),
('วีร์สุดา เนื้อนุ่ม', 'aetkulsuththinath@example.org', 'F', '2008-5-6', 500, '2026-3-3'),
('เมทนี ไม้แดง', 'jelkhaphanthu@example.org', 'F', '2006-9-23', 0, '2025-9-20'),
('ธมน พรรษาสกุล', 'udmlaksn16@example.org', 'F', '2002-7-19', 0, '2025-4-11'),
('ธีรลักษณ์ ธีวร', 'qnphtrakuul@example.net', 'M', '2003-6-3', 500, '2026-3-25'),
('อุลัยพร บินดี', 'sorchaa20@example.net', 'M', '2002-4-7', 0, '2026-10-26'),
('ณัฐพิชา แก้วชลคราม', 'thnuupkrnnirandr@example.com', 'M', '2008-1-9', 0, '2025-11-9'),
('ชนิศา ดาวอร่าม', 'yaapaolhitphiirphathr@example.net', 'M', '2002-1-4', 1000, '2025-9-15'),
('มนรัตน์ นาควงษ์', 'suaihlanpaansuwrrn@example.com', 'M', '2013-1-22', 0, '2025-4-9'),
('พันเกล้า ตรีเภรินทร์', 'kulphaawlay24@example.com', 'F', '2013-2-22', 1000, '2026-9-20'),
('อำพร นาฏคายี', 'bniymechiiym@example.org', 'M', '2000-5-10', 1000, '2026-7-9'),
('ชัชเวศย์ บินดี', 'pngaamphiechsth@example.com', 'M', '2007-10-11', 5000, '2026-12-18'),
('สายสุรีย์ บัวเผื่อน', 'srlaksnsiwawrewth@example.com', 'F', '2003-2-27', 500, '2026-3-9'),
('อัญธิกา ดาตู', 'thngsukelissiriladdaa@example.com', 'M', '2003-4-16', 0, '2025-11-7'),
('ซูฮัยดา ราชมณี', 'thwiiwathn12@example.org', 'F', '2011-10-8', 500, '2025-4-20'),
('พาสุข ราชมณี', 'talaphatsuchin@example.com', 'F', '2013-10-27', 1000, '2025-1-6'),
('วัลลภ นวลฉวี', 'cchamraswilaasinii@example.org', 'F', '2012-1-19', 500, '2026-9-22');

-- ## ADDRESS ##
INSERT INTO address (address_type, cust_id, line_1, province, postal_code) VALUES
('work', 1, '69/5 ซอยเขียวอ่อน ต.ปากแจ่ม', 'อ.เทิง', '20220'),
('work', 2, '75 หมู่ 11 ถ.ยาปะโลหิต ปังหวาน ศรีวิไล', 'พังงา', '31580'),
('home', 3, '78 ถนนเยาวธนโชค', 'นครพนม', '44390'),
('work', 4, '869 หมู่บ้านอาภัศรา บึงกุ่ม', 'กาญจนบุรี', '41100'),
('work', 5, '662/4 ถนนเยาวธนโชค ศรีสงคราม', 'พระนครศรีอยุธยา', '59800'),
('home', 6, '333 ซ.ดาบเพ็ชร์ ต.บางเล่า', 'อ.เขาสมิง', '99080'),
('work', 7, '36/98 ถ.ติระคมน์ เกษตรสมบูรณ์', 'กรุงเทพฯ', '29560'),
('work', 8, '869 ถนนเธียรายัน อำเภอบึงกุ่ม', 'อำนาจเจริญ', '82590'),
('home', 9, '50 ซอยตั้งกุลงาม ต.เปือยใหญ่ อ.ปากคาด', 'หนองคาย', '30640'),
('home', 10, '05 ถนนมิ่งขวัญ อำเภอหนองบัวแดง', 'ศรีสะเกษ', '79100'),
('home', 11, '54 หมู่ 1 ถนนเยาวธนโชค อ.หนองบัวโคก', 'ตรัง', '55090'),
('work', 12, '5/5 ถนนนฤภัย ตำบลเขาขาวใหญ่ อำเภอภักดีชุมพล', 'ลพบุรี', '99960'),
('work', 13, '5/2 ถ.ทวนไชย์ อำเภอป้อมปราบศัตรูพ่าย', 'ราชบุรี', '94220'),
('home', 14, '68 หมู่ 4 ถนนสันตะวงศ์ วัดท่างิ้ว', 'สตูล', '93570'),
('home', 15, '822/65 ถนนทรัพย์สาร อำเภอบางสะพานน้อย', 'สระแก้ว', '89530'),
('home', 16, '10/1 ถนนนุชแนวนุ่ม ตำบลบางโรงใหญ่ อำเภอแม่สรวย', 'น่าน', '54150'),
('work', 17, '75/7 ถนนงามพิเชษฐ์ อ.บ้านแท่น', 'พระนครศรีอยุธยา', '95450'),
('home', 18, '77 ถ.ทับทิมไทย ต.หนองแสง อ.ศรีสงคราม', 'กระบี่', '71920'),
('home', 19, '79 ถนนแหยมศิริ ต.โนนสูง', 'อ.โพนสวรรค์', '92510'),
('home', 20, '95 ถนนติระคมน์ วังทองหลาง', 'กรุงเทพมหานคร', '54680'),
('home', 21, '92/2 ถ.ขันธุลา ต.เปือยใหญ่ อ.หนอกจอก', 'สงขลา', '55630'),
('work', 22, '40 ต.บางแค อ.เกษตรสมบูรณ์', 'แพร่', '53460'),
('home', 23, '5 ถนนถนัดกลึง ตำบลบางกุ้งเหนือ อำเภอแม่ลาว', 'เลย', '38330'),
('work', 24, '801/03 ถนนธนรักษ์ หนองตอกแป้น ภูเขียว', 'กรุงเทพฯ', '71420'),
('home', 25, '956/1 ถนนตรีครุธพันธุ์ อ.สามโคก', 'ศรีสะเกษ', '83470'),
('work', 26, '81 หมู่ 30 ถนนหนุนสุข ต.ยางตลาดเหนือ อ.หนองบัวระเหว', 'อุดรธานี', '27420'),
('work', 27, '340/11 ถ.จันทา นาเชือก', 'สุราษฎร์ธานี', '68530'),
('home', 28, '0/9 ถ.นาคะนคร ตำบลป่าเขาปูน อำเภอสะพานสูง', 'เพชรบุรี', '57120'),
('home', 29, '06 หมู่ 8 ถ.บุนยาภิสนท์ ต.เขาพระนอน อ.ภาษีเจริญ', 'ฉะเชิงเทรา', '57400'),
('work', 30, '09 หมู่ 63 ถนนขำเอนก ต.ปากทรง อ.นาทม', 'ชลบุรี', '60950'),
('work', 31, '5 ถ.บุญญาภิรมย์ หัวงัว หนองบัวโคก', 'พะเยา', '24450'),
('home', 32, '2/0 ถนนพรสีมา อ.เทิง', 'นครราชสีมา', '70520'),
('home', 33, '966 ถ.ไทยสุชาต ต.หนองปลาหมอ อ.คอนสวรรค์', 'สุโขทัย', '76480'),
('home', 34, '62 ถนนเตชะกำพุ ตำบลปากพลีเหนือ อำเภอแม่สรวย', 'กรุงเทพ', '58020'),
('work', 35, '456/3 ถนนยะผา ต.นาหินลาด', 'อ.บ้านแท่น', '23370'),
('work', 36, '5 ถ.นาควงษ์ เวียงชัย', 'เชียงราย', '78980'),
('home', 37, '80 ถ.นักรบ ภูเขียว', 'ราชบุรี', '94390'),
('work', 38, '6 ถ.นิติสาขา ต.คลองขามใต้ อ.บำเหน็จณรงค์', 'เลย', '10010'),
('work', 39, '3 ถ.ตั้งกุลงาม ตำบลเปือยใหญ่กลาง อำเภอเทพสถิต', 'นครปฐม', '10440');

-- ## CATEGORY ##
INSERT INTO category (category_id, name) VALUES
(1, 'Books'),
(2, 'Movies'),
(3, 'Music'),
(4, 'Games'),
(5, 'Electronics'),
(6, 'Computers'),
(7, 'Home'),
(8, 'Garden'),
(9, 'Tools'),
(10, 'Grocery'),
(11, 'Health'),
(12, 'Beauty'),
(13, 'Toys'),
(14, 'Kids'),
(15, 'Baby'),
(16, 'Clothing'),
(17, 'Shoes'),
(18, 'Jewelery'),
(19, 'Sports'),
(20, 'Outdoors'),
(21, 'Automotive'),
(22, 'Industrial'),
(23, 'Steel'),
(24, 'Wooden'),
(25, 'Concrete'),
(26, 'Plastic'),
(27, 'Cotton'),
(28, 'Granite'),
(29, 'Rubber'),
(30, 'Metal'),
(31, 'Soft'),
(32, 'Fresh'),
(33, 'Frozen'),
(34, 'Small'),
(35, 'Ergonomic'),
(36, 'Rustic'),
(37, 'Intelligent'),
(38, 'Gorgeous'),
(39, 'Incredible'),
(40, 'Fantastic'),
(41, 'Practical'),
(42, 'Sleek'),
(43, 'Awesome'),
(44, 'Generic'),
(45, 'Handcrafted'),
(46, 'Handmade'),
(47, 'Licensed'),
(48, 'Refined'),
(49, 'Unbranded'),
(50, 'Tasty'),
(51, 'New'),
(52, 'Gently Used'),
(53, 'Used'),
(54, 'For repair');

-- ## PRODUCT ##
INSERT INTO product (name, price, stock) VALUES
('Handcrafted Keyboard', 150, 10),
('Plastic Mouse', 252, 26),
('Used Chips', 285, 54),
('Plastic Salad', 404, 90),
('Chicken', 239, 148),
('Bacon', 319, 62),
('Plastic Towels', 261, 98),
('Gorgeous Tuna', 145, 176),
('Shoes', 69, 31),
('Handcrafted Cotton Cheese', 177, 172),
('Steel Car', 455, 136),
('Metal Computer', 40, 161),
('Small Tuna', 269, 103),
('Fresh Chips', 178, 175),
('Hat', 200, 188),
('Sleek Steel Bike', 272, 160),
('Unbranded Metal Towels', 360, 110),
('Bike', 588, 133),
('Practical Bacon', 536, 110);

-- ## PRODUCT CATEGORIES ##
INSERT INTO product_category (product_id, category_id) VALUES
(1, 2), (1, 27), (1, 33), (1, 36),
(2, 2), (2, 36), (2, 39), (2, 32), (2, 27),
(3, 4), (3, 42), (3, 52),
(4, 7), (4, 37), (4, 48), (4, 30), (4, 51),
(5, 15), (5, 28), (5, 41), (5, 36), (5, 33), (5, 49),
(6, 12), (6, 36), (6, 50),
(7, 7), (7, 52), (7, 25),
(8, 9), (8, 32), (8, 46), (8, 42), (8, 39), (8, 29),
(9, 16), (9, 41), (9, 50), (9, 25),
(10, 15), (10, 22), (10, 40), (10, 48),
(11, 12), (11, 23), (11, 31),
(12, 5), (12, 29), (12, 51),
(13, 6), (13, 47), (13, 35),
(14, 2), (14, 27), (14, 47), (14, 29),
(15, 11), (15, 43), (15, 23), (15, 26), (15, 39), (15, 32),
(16, 15), (16, 22), (16, 29), (16, 44), (16, 23),
(17, 16), (17, 45), (17, 51), (17, 41),
(18, 8), (18, 43), (18, 45),
(19, 6), (19, 33), (19, 51), (19, 39);

-- ## SHOP ORDER ##
INSERT INTO shop_order (cust_id, order_date, status, address_id, sub_total, discount) VALUES
(1, '2026-9-7', 'cancel', 1, 0, 0),
(2, '2025-8-10', 'shipped', 2, 0, 0),
(3, '2025-9-18', 'shipped', 3, 0, 0),
(4, '2026-8-2', 'complete', 4, 0, 0),
(5, '2026-1-4', 'shipped', 5, 0, 0),
(6, '2026-6-5', 'cancel', 6, 0, 0),
(7, '2026-1-4', 'shipped', 7, 0, 0),
(8, '2026-1-7', 'pending', 8, 0, 0),
(9, '2026-6-26', 'shipped', 9, 0, 0);

-- ## ORDER LINE ##
INSERT INTO order_line(order_id, product_id, qty, unit_price) VALUES
(1, 15, 2, 0), (1, 5, 2, 0), (1, 18, 4, 0), (1, 10, 1, 0), (1, 13, 4, 0), (1, 2, 1, 0), (1, 7, 3, 0),
(2, 2, 1, 0), (2, 19, 2, 0), (2, 4, 2, 0), (2, 18, 2, 0), (2, 11, 2, 0), (2, 7, 1, 0), (2, 12, 4, 0), (2, 14, 1, 0),
(3, 11, 3, 0), (3, 6, 2, 0), (3, 5, 1, 0), (3, 4, 4, 0), (3, 18, 2, 0), (3, 1, 1, 0), (3, 8, 3, 0),
(4, 8, 3, 0), (4, 9, 4, 0), (4, 7, 1, 0), (4, 14, 2, 0),
(5, 17, 2, 0), (5, 5, 3, 0), (5, 10, 1, 0), (5, 6, 3, 0), (5, 12, 3, 0), (5, 16, 3, 0), (5, 18, 4, 0), (5, 9, 1, 0), (5, 14, 4, 0),
(6, 16, 2, 0), (6, 15, 3, 0), (6, 4, 1, 0), (6, 8, 1, 0),
(7, 15, 1, 0), (7, 7, 4, 0), (7, 5, 1, 0), (7, 19, 3, 0), (7, 14, 4, 0),
(8, 9, 3, 0), (8, 1, 3, 0), (8, 2, 2, 0), (8, 7, 2, 0), (8, 11, 1, 0),
(9, 10, 3, 0);

-- ## REVIEW ##
INSERT INTO review (cust_id, order_id, product_id, rating, comment) VALUES
(37, 1, 6, 5, 'คบกลางคืนดังนี้ตีนคำถามประสบการณ์ทอดมัน เสรีนิยมความหลบโผล่ ครูบันไดกำแท็กซี่อิสลามกูเกิล '),
(21, 2, 4, 2, 'ชุดนอนอวัยวะยาทดอวัยวะโดยตัวอย่าง ห้องเรียนหน้าต่างคอก '),
(10, 3, 5, 3, 'มลายูพยาธิคาวกลางคืนสมาคมสำนักงานข้าวศิษย์ ถกเถียงใบไม้แซงครองลูกถีบแรงงาน '),
(23, 4, 17, 3, 'ห้องเรียนอวัยวะแม่มด ซี่แก่ฉีดสีเทาท้องฟ้า ไอศกรีมทานรอกล่องฤดูกว้าง '),
(5, 5, 15, 2, 'ขนมที่ดินแกะประชาธิปไตยตู้ คบมอบเข้ารหัสเศษเยาวชน '),
(24, 6, 8, 5, 'ฝากเริ่มเย็นผลเสรีนิยมหาม้ายสีแดง ดำแกกะเพราสำนักงานเทเลแกรมทด '),
(6, 7, 11, 2, 'ครูข้าวกับสบาย แม่น้องทาน '),
(27, 8, 19, 3, 'อาสาวิ่งในผสม ฤดูเยอะหอยสีแดง สม่ำเสมอเล่มตลอดข้าวสัญญาคั่ว '),
(25, 9, 19, 4, 'ผสมเนื่องจากผลเคยขัดเข้ารหัสจาก ชะนีกว้างตื่นโตต้นครอง เยาวชนดูฟากยันบอกใบ้เกาหลีคลาน ');

-- ## PAYMENT ##
INSERT INTO payment (order_id, method, amount, paid_date) VALUES
( 1, 'credit card', 0, '2026-5-17'),
( 2, 'credit card', 0, '2026-7-12'),
( 3, 'credit card', 0, '2025-6-9'),
( 4, 'online banking', 0, '2025-11-8'),
( 5, 'online banking', 0, '2026-2-17'),
( 6, 'online banking', 0, '2025-8-3'),
( 7, 'online banking', 0, '2026-1-6'),
( 8, 'credit card', 0, '2026-2-20'),
( 9, 'online banking', 0, '2025-4-17');

-- ## UPDATE ORDER LINE unit_price ##
UPDATE order_line
SET unit_price = (SELECT p.price FROM product p WHERE p.product_id = order_line.product_id);

-- ## UPDATE SHOP ORDER sub_total ##
UPDATE shop_order
SET sub_total = COALESCE((SELECT SUM(ol.qty * ol.unit_price)
FROM order_line ol
WHERE ol.order_id = shop_order.order_id), 0);

-- ## UPDATE PAYMENT amount ##
UPDATE payment
SET amount = (SELECT sub_total - discount FROM shop_order WHERE shop_order.order_id = payment.order_id),
 paid_date = (SELECT order_date FROM shop_order WHERE shop_order.order_id = payment.order_id);

