
-- ## CUSTOMER ##
INSERT INTO customer (name, email, gender, birthdate, point, join_date) VALUES
('วีระโชติ วาทา', 'wichchaakr21@example.org', 'F', '2006-6-11', 5000, '2025-4-26'),
('นารดา ดำริห์ชอบ', 'wrrnkrsuwrrnhngs@example.net', 'F', '2001-5-24', 5000, '2026-12-9'),
('พิไลพร พงศ์ฉบับนภา', 'thiiraathat70@example.net', 'F', '2001-8-22', 5000, '2026-8-13'),
('กิติยาธรณ์ ธรรมฤดี', 'thngpradithwanchatr@example.com', 'M', '2012-4-15', 1000, '2026-9-10'),
('วรินทธิ์ธร ประจันตะเสน', 'thatthn56@example.org', 'F', '2010-8-10', 1000, '2025-11-18'),
('ปิยวัจน์ ถนัดการยนต์', 'chuuraydaa46@example.org', 'M', '2013-7-12', 5000, '2025-4-12'),
('ญาณพันธุ์ ไทไชโย', 'wrsaass75@example.org', 'M', '2013-2-19', 500, '2026-4-26'),
('รักชนก จ้อยนุแสง', 'aiklrung44@example.org', 'F', '2010-4-14', 1000, '2026-9-26'),
('หรรษธร ดุษฎีวนิช', 'mnratn75@example.com', 'M', '2008-8-27', 0, '2026-3-19'),
('พิมพ์พิชญา จ้อยนุแสง', 'nawamandrrrcchn@example.net', 'M', '2011-1-28', 500, '2025-1-27'),
('กวาง ธูปหอม', 'numkansuphatraa@example.net', 'F', '2002-1-15', 5000, '2026-1-12'),
('สุพนธ์ ตั้งรบ', 'thaawrawrnphaswii@example.com', 'F', '2011-11-10', 500, '2026-9-1'),
('ธีริสรา ศาสตร์ศิลป์', 'naththitaathnadkaarynt@example.org', 'M', '2002-1-6', 500, '2025-1-13'),
('วิชชากร ดาวอร่าม', 'mnakrb@example.net', 'F', '2000-1-8', 5000, '2025-7-11'),
('สมหมาย แถมธน', 'wrinththithr01@example.org', 'F', '2002-3-20', 500, '2025-3-24'),
('สโรชา ธูปะวิโรจน์', 'buybamrungemthnii@example.com', 'M', '2006-3-1', 0, '2025-2-14'),
('สมหมาย โพธิสัตย์', 'ekrikphl61@example.org', 'M', '2001-12-24', 500, '2025-12-28'),
('ธีรวัช ดาบเงิน', 'nnabenuuengn@example.com', 'F', '2006-8-27', 500, '2026-8-2'),
('วัลลภ เขียวอ่อน', 'gnrwithyochtikul@example.org', 'F', '2010-11-27', 1000, '2026-11-4'),
('ปรายกานต์ แท่นทอง', 'phichaaphphnilesnaa@example.com', 'F', '2012-3-17', 1000, '2025-5-13'),
('บุญเอก บุญศล', 'thraphysaarphaaninii@example.com', 'F', '2000-12-26', 5000, '2025-9-14'),
('เกษตร ธนรักษ์', 'khdieyaaa84@example.org', 'M', '2003-11-6', 0, '2025-3-5'),
('มณียา นครเทพ', 'mnamthwach@example.org', 'M', '2007-9-6', 500, '2025-12-15'),
('เบญญาทิพย์ ธุวะนุติ์', 'ayphachreyaawthnochkh@example.com', 'F', '2011-1-20', 0, '2026-9-26'),
('นพวรรณ ภูภักดี', 'thnadraksaathraawithy@example.org', 'F', '2004-7-5', 0, '2026-5-14'),
('ปรายกานต์ นานายน', 'khammanphlbuy@example.net', 'F', '2007-8-27', 5000, '2025-4-1'),
('มาโนชญ์ นิลสุวรรณ์', 'xthngenuuedii@example.com', 'F', '2000-12-17', 5000, '2025-3-12'),
('เพียงกมล บุญญาภิรมย์', 'wrnaadthwnsrii@example.net', 'F', '2008-11-19', 500, '2025-10-6'),
('วัลยา ทองสีไพล', 'sattnaath@example.net', 'M', '2003-8-16', 0, '2026-11-3'),
('จณิตตา ถาวรายุศม์', 'philaksnthnadaksr@example.net', 'M', '2009-4-25', 5000, '2026-12-4'),
('อนุบาล พีระเพ็ญกุล', 'ysangkhkrd@example.org', 'M', '2011-2-5', 500, '2026-8-16'),
('เมทนี พรรษาสกุล', 'maarud83@example.org', 'M', '2002-2-18', 0, '2025-8-4'),
('โสภณ นานายน', 'phimphkaant48@example.net', 'F', '2008-12-22', 1000, '2026-4-16'),
('ฟิรยา นกทอง', 'adusdiiwnich@example.org', 'F', '2012-11-16', 0, '2026-8-20'),
('วรนาฎ มิ่งขวัญ', 'santiraasdr82@example.net', 'M', '2002-7-27', 0, '2026-11-17'),
('พีรภัทร์ ตรีเภรินทร์', 'thnmmnusyrphasphngs@example.com', 'M', '2007-7-27', 1000, '2026-11-18'),
('ปริญญา นับเนื่องนอ', 'oaehymsiri@example.com', 'F', '2000-6-9', 1000, '2025-7-13'),
('แปลง ศรีอุ่น', 'nubaal61@example.net', 'M', '2004-12-13', 1000, '2026-12-19'),
('ธัญญกัญญา นิละทัต', 'eksraathnadrb@example.net', 'F', '2001-8-9', 500, '2025-8-17');

-- ## ADDRESS ##
INSERT INTO address (address_type, cust_id, line_1, province, postal_code) VALUES
('home', 1, '364/70 ถนนถนัดกลึง ต.โนนสูง อ.ป้อมปราบศัตรูพ่าย', 'สุรินทร์', '47550'),
('home', 2, '06 หมู่ 91 ถ.ธรรมฤดี ตำบลนาเชือก อำเภอบ้านเขว้า', 'น่าน', '93930'),
('home', 3, '864 ถ.ตวงทอง ต.นาวง', 'ระยอง', '67230'),
('home', 4, '49/34 ถนนผลบุญ อำเภอนาแก', 'กรุงเทพ', '19040'),
('home', 5, '41/57 ถ.ศาสตร์ศิลป์ กะบกเตี้ยใหญ่', 'สระบุรี', '26570'),
('work', 6, '117/72 ถนนถนัดพิมพการ บ้านเขว้า', 'สุราษฎร์ธานี', '30190'),
('work', 7, '418 ถนนถนอมมนุษย์ อ.เวียงชัย', 'ตรัง', '74070'),
('work', 8, '6 ถนนทรัพย์สาร อำเภอภาษีเจริญ', 'สุรินทร์', '43700'),
('work', 9, '15/8 ถ.ทองเนื้อดี อำเภอแม่สรวย', 'ขอนแก่น', '69240'),
('work', 10, '09/16 ถ.ยางสวย', 'กาฬสินธุ์', '97560'),
('home', 11, '65 ถนนชำนาญวาด อ.ภาษีเจริญ', 'พิจิตร', '31200'),
('home', 12, '90 หมู่ 06 ถ.ทรงโกมล ต.ห้วยยอดใต้ อ.เฉลิมพระเกียรติ', 'พระนครศรีอยุธยา', '66860'),
('work', 13, '426/5 ถ.วาทา ต.โนนศิลา', 'พังงา', '87530'),
('work', 14, '998/85 ถนนนกทอง ต.บ้านท่างิ้ว อ.เกษตรสมบูรณ์', 'แพร่', '98870'),
('work', 15, '2/1 ถ.ประจันตะเสน เขาพระนอน สามโคก', 'ตราด', '83500'),
('home', 16, '566 ถนนแท่นทอง อ.วังยาง', 'อุทัยธานี', '68300'),
('home', 17, '77 หมู่ 58 ซ.ธรรมนิยม อำเภอภักดีชุมพล', 'ชัยนาท', '83500'),
('work', 18, '00/5 ถนนทับทิมไทย อำเภอปากคาด', 'สงขลา', '72570'),
('home', 19, '28 หมู่ 77 ถนนนวลฉวี ตำบลห้วยยอด', 'ปทุมธานี', '19570'),
('home', 20, '561/63 ถ.ราชมณี ป้อมปราบศัตรูพ่าย', 'ตราด', '38280'),
('home', 21, '47 หมู่ 8 หมู่บ้านอิสรันดร์ ซับใหญ่', 'ศรีสะเกษ', '76140'),
('home', 22, '44/29 ถ.ทรงโกมล อำเภอเทิง', 'นครนายก', '76680'),
('home', 23, '15 หมู่บ้านศศิธร สะพานสูง', 'นครราชสีมา', '59090'),
('work', 24, '63 ซ.สังข์กรด โนนศิลา พระนคร', 'ปทุมธานี', '55000'),
('home', 25, '4/8 ถ.ทรัพย์สาร ต.เขาพระนอน', 'อ.นาแก', '18150'),
('home', 26, '06/0 ถ.แต้กุล อำเภอภักดีชุมพล', 'อุบลราชธานี', '63270'),
('work', 27, '718 ถ.บุนยะตีรณะ นาทม', 'ร้อยเอ็ด', '40830'),
('work', 28, '49 หมู่ 7 ถนนถะเกิงชศ ต.ปากพลี', 'อ.เนินสง่า', '51600'),
('home', 29, '05 หมู่ 6 ถนนผลบุญ ตำบลปากทรงใต้', 'กำแพงเพชร', '12010'),
('home', 30, '79 ถ.ดิศดใน ต.บึงปังหวาน อ.พระนคร', 'สกลนคร', '51550'),
('home', 31, '36 หมู่ 0 ถ.เดชวา ต.บางตลาด อ.เทพสถิต', 'นครปฐม', '98710'),
('home', 32, '50 หมู่ 16 ถนนถนอมมนุษย์ ต.ยางตลาด อ.บึงกุ่ม', 'บุรีรัมย์', '43780'),
('home', 33, '38 หมู่ 3 ถนนวุฑฒยากร ต.พระรักษ์', 'อ.เวียงแก่น', '73340'),
('work', 34, '02 หมู่ 8 ถนนนิลสุวรรณ์ ตำบลพะโต๊ะ อำเภอศรีสงคราม', 'นนทบุรี', '56830'),
('work', 35, '62 หมู่ 7 ถนนทรัพย์สาร ตำบลบางแคเล็ก อำเภอซับใหญ่', 'สุโขทัย', '25660'),
('work', 36, '12 หมู่ 2 ถนนเดชวา ตำบลนาดีใต้ อำเภอคอนสวรรค์', 'ลำพูน', '68590'),
('work', 37, '774/02 ถนนทับทิมไทย ตำบลเขากอบใหญ่ อำเภอภาษีเจริญ', 'กรุงเทพมหานคร', '45220'),
('work', 38, '846 ถ.ชุมวระ อำเภอปากคาด', 'ตรัง', '40960'),
('work', 39, '296/64 ถ.นวลฉวี ต.ท่างิ้วใต้ อ.หนองบัวโคก', 'นครพนม', '79520');

-- ## CATEGORY ##
INSERT INTO category (category_id, name) VALUES
(1, 'Books'),
(2, 'Movies'),
(3, 'Music'),
(4, 'Games'),
(5, 'Electronics'),
(6, 'Computers'),
(7, 'Home'),
(8, 'Garden'),
(9, 'Tools'),
(10, 'Grocery'),
(11, 'Health'),
(12, 'Beauty'),
(13, 'Toys'),
(14, 'Kids'),
(15, 'Baby'),
(16, 'Clothing'),
(17, 'Shoes'),
(18, 'Jewelery'),
(19, 'Sports'),
(20, 'Outdoors'),
(21, 'Automotive'),
(22, 'Industrial'),
(23, 'Steel'),
(24, 'Wooden'),
(25, 'Concrete'),
(26, 'Plastic'),
(27, 'Cotton'),
(28, 'Granite'),
(29, 'Rubber'),
(30, 'Metal'),
(31, 'Soft'),
(32, 'Fresh'),
(33, 'Frozen'),
(34, 'Small'),
(35, 'Ergonomic'),
(36, 'Rustic'),
(37, 'Intelligent'),
(38, 'Gorgeous'),
(39, 'Incredible'),
(40, 'Fantastic'),
(41, 'Practical'),
(42, 'Sleek'),
(43, 'Awesome'),
(44, 'Generic'),
(45, 'Handcrafted'),
(46, 'Handmade'),
(47, 'Licensed'),
(48, 'Refined'),
(49, 'Unbranded'),
(50, 'Tasty'),
(51, 'New'),
(52, 'Gently Used'),
(53, 'Used'),
(54, 'For repair');

-- ## PRODUCT ##
INSERT INTO product (name, price, stock) VALUES
('Concrete Table', 556, 23),
('Generic Computer', 180, 115),
('Cotton Towels', 527, 78),
('Refined Chair', 169, 167),
('Granite Soap', 480, 84),
('Ergonomic Soft Towels', 349, 13),
('Concrete Bacon', 276, 119),
('Rustic Shirt', 38, 72),
('Soft Bacon', 116, 179),
('Wooden Bacon', 333, 172),
('Pizza', 116, 86),
('Rubber Sausages', 209, 178),
('Steel Gloves', 540, 172),
('Soft Chips', 231, 159),
('Tasty Rubber Shoes', 472, 23),
('Practical Pizza', 353, 104),
('Rubber Keyboard', 174, 38),
('Gloves', 593, 55),
('Sleek Car', 494, 46);

-- ## PRODUCT CATEGORIES ##
INSERT INTO product_category (product_id, category_id) VALUES
(1, 5), (1, 51), (1, 24), (1, 36), (1, 53), (1, 52),
(2, 11), (2, 31), (2, 41), (2, 42), (2, 39), (2, 33),
(3, 14), (3, 43), (3, 30), (3, 33), (3, 36),
(4, 11), (4, 43), (4, 36),
(5, 3), (5, 43), (5, 21), (5, 29), (5, 43),
(6, 9), (6, 47), (6, 52), (6, 25), (6, 42), (6, 48),
(7, 4), (7, 51), (7, 33),
(8, 11), (8, 44), (8, 43),
(9, 13), (9, 34), (9, 42), (9, 42),
(10, 12), (10, 47), (10, 42), (10, 40),
(11, 12), (11, 41), (11, 47),
(12, 16), (12, 21), (12, 46), (12, 31), (12, 51),
(13, 19), (13, 51), (13, 40), (13, 49), (13, 53),
(14, 19), (14, 31), (14, 42), (14, 46),
(15, 6), (15, 38), (15, 22), (15, 30),
(16, 12), (16, 38), (16, 47),
(17, 17), (17, 29), (17, 50),
(18, 1), (18, 47), (18, 41), (18, 20),
(19, 9), (19, 22), (19, 45), (19, 31), (19, 48), (19, 53);

-- ## SHOP ORDER ##
INSERT INTO shop_order (cust_id, order_date, status, address, sub_total, discount) VALUES
(1, '2025-5-14', 'pending', 1, 0, 0),
(2, '2026-9-26', 'shipped', 2, 0, 0),
(3, '2026-2-10', 'pending', 3, 0, 0),
(4, '2026-2-23', 'pending', 4, 0, 0),
(5, '2026-11-8', 'cancel', 5, 0, 0),
(6, '2025-5-24', 'cancel', 6, 0, 0),
(7, '2026-6-21', 'pending', 7, 0, 0),
(8, '2026-8-28', 'cancel', 8, 0, 0),
(9, '2026-1-22', 'pending', 9, 0, 0);

-- ## ORDER LINE ##
INSERT INTO order_line(order_id, product_id, qty, unit_price) VALUES
(1, 13, 2, 0), (1, 11, 1, 0),
(2, 3, 1, 0), (2, 5, 1, 0), (2, 11, 1, 0), (2, 1, 1, 0), (2, 18, 1, 0), (2, 13, 4, 0), (2, 16, 2, 0), (2, 2, 3, 0), (2, 15, 3, 0),
(3, 15, 3, 0), (3, 14, 1, 0), (3, 4, 2, 0), (3, 12, 1, 0), (3, 9, 3, 0), (3, 18, 2, 0), (3, 2, 3, 0), (3, 11, 2, 0),
(4, 8, 2, 0), (4, 5, 1, 0),
(5, 17, 3, 0), (5, 7, 2, 0), (5, 4, 3, 0), (5, 13, 4, 0), (5, 12, 4, 0), (5, 2, 4, 0), (5, 3, 4, 0), (5, 11, 4, 0), (5, 14, 4, 0),
(6, 18, 4, 0), (6, 5, 2, 0), (6, 14, 4, 0),
(7, 16, 1, 0),
(8, 6, 1, 0), (8, 1, 4, 0), (8, 17, 3, 0), (8, 12, 1, 0), (8, 9, 3, 0), (8, 18, 4, 0), (8, 14, 2, 0), (8, 5, 2, 0),
(9, 13, 2, 0), (9, 1, 3, 0), (9, 14, 1, 0), (9, 8, 2, 0), (9, 16, 1, 0);

-- ## REVIEW ##
INSERT INTO review (cust_id, order_id, product_id, rating, comment) VALUES
(26, 1, 2, 3, 'สมาคมดีกิจกรรมเข้ารหัสสมาคม เงาสนองผัก ไอศกรีมเห็นแถบไค้หัน แม่มดอินสตาแกรมเรียง '),
(5, 2, 9, 1, 'โน่นโกงกีฬาสุขภาพ ห่อข้าวน้าแข่งขันแม่มดปิ่นโตกิโลเมตร '),
(35, 3, 9, 5, 'เพดานสหกรณ์ซอยชนิด ไอโอเอสขี้ไคลเล่ม ไต้หยักผักรังแก '),
(9, 4, 8, 3, 'อนุบาลเงาลูกตาตำลึง '),
(19, 5, 12, 3, 'หลบอธิษฐานสมอง รถถังอนุบาลวิชาชีพหลบยันมอบฟาก สมองกีฬาอนุบาลควรบาดฝาก ตลอดพ่อซี่เอิดพักผ่อนร่าง '),
(17, 6, 1, 3, 'คอกบัดนี้อินเทอร์เน็ตคั่วแจ่มใสเคเอฟซี ชาวนารู้จักแถบแพ้ '),
(25, 7, 14, 5, 'หมัดฉีดอิสลามเปลืองซ่อน แรกแกะแม้สำนักงานอ่อนหวานครองคบ '),
(38, 8, 18, 4, 'วาดทำสวนกิจกรรมแก คาวน้าวิ่งสุขภาพนักเรียนแข่งขันโตยถึง '),
(27, 9, 7, 1, 'แกะเมตตาต้นสุขภาพตะแกรง ');

-- ## PAYMENT ##
INSERT INTO payment (order_id, method, amount, paid_date) VALUES
( 1, 'credit card', 0, '2025-4-8'),
( 2, 'online banking', 0, '2025-4-25'),
( 3, 'online banking', 0, '2025-8-16'),
( 4, 'online banking', 0, '2026-2-25'),
( 5, 'credit card', 0, '2025-9-23'),
( 6, 'online banking', 0, '2026-10-6'),
( 7, 'credit card', 0, '2025-1-1'),
( 8, 'online banking', 0, '2026-11-6'),
( 9, 'credit card', 0, '2025-6-20');

-- ## UPDATE ORDER LINE unit_price ##
UPDATE order_line
SET unit_price = (SELECT p.price FROM product p WHERE p.product_id = order_line.product_id);

-- ## UPDATE SHOP ORDER sub_total ##
UPDATE shop_order
SET sub_total = COALESCE((SELECT SUM(ol.qty * ol.unit_price)
FROM order_line ol
WHERE ol.order_id = shop_order.order_id), 0);

-- ## UPDATE PAYMENT amount ##
UPDATE payment
SET amount = (SELECT sub_total - discount FROM shop_order WHERE shop_order.order_id = payment.order_id),
 paid_date = (SELECT order_date FROM shop_order WHERE shop_order.order_id = payment.order_id);

